{
  "backend/main.mo": "Motoko backend providing access‑controlled user profiles, quizzes, and quiz attempt storage with authentication checks.",
  "feature_evidence.json": "Feature evidence report listing implemented navigation, authentication, and subscription UI features with related files and components.",
  "frontend-file-summaries.txt": "Text file aggregating short descriptions of all frontend components, pages, hooks, configs, and deployment docs.",
  "frontend/deployment/DEPLOYMENT_CHECKLIST.md": "Deployment checklist detailing steps and routes to verify when deploying the Navy education app.",
  "frontend/deployment/DEPLOYMENT_OUTPUTS_TEMPLATE.md": "Template for recording deployment details including canister IDs, URLs, and metadata.",
  "frontend/deployment/ROUTE_SMOKE_NAV.md": "Manual navigation test guide listing all routes and expected UI elements for smoke testing.",
  "frontend/deployment/SMOKE_TEST_CORE_FLOWS.md": "Smoke test document outlining verification steps for quizzes, progress, authentication, and profile flows.",
  "frontend/index.css": "Global Tailwind‑based styles defining color tokens, dark mode values, and base layout variables.",
  "frontend/index.html": "HTML entry file setting document metadata and loading the frontend app root.",
  "frontend/src/App.tsx": "Sets up the main TanStack router with all site routes and renders the RouterProvider.",
  "frontend/src/components/AuthNavControl.tsx": "Provides login/logout button logic using Internet Identity and React Query cache handling.",
  "frontend/src/components/PrimaryNav.tsx": "Renders the main navigation bar with desktop and mobile menus, subscribe link, and auth controls.",
  "frontend/src/components/SiteLayout.tsx": "Defines the global page layout including navigation, main content outlet, and footer.",
  "frontend/src/config/branding.ts": "Centralizes site branding info including names and logo asset paths.",
  "frontend/src/games/ShipLogTimelineGame.tsx": "Implements a dragless timeline-ordering game where users arrange Navy history events.",
  "frontend/src/games/SignalFlagsMemoryGame.tsx": "Implements a memory-matching game using naval signal flags with flip and match logic.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, auto-refreshing dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading identities, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching quizzes, quiz details, questions, progress, and submitting quiz attempts through an actor.",
  "frontend/src/index.css": "Configures Tailwind CSS with custom theme variables, dark mode styles, base typography, and accessibility-focused utilities.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering the root component.",
  "frontend/src/pages/AboutPoliciesPage.tsx": "Renders an informational page describing the site's mission, disclaimers, privacy practices, and data policies.",
  "frontend/src/pages/GamePlayPage.tsx": "Displays an individual game based on URL params and renders the corresponding game component or a fallback message.",
  "frontend/src/pages/GamesPage.tsx": "Lists available educational games with descriptions and links to play, along with general game guidelines.",
  "frontend/src/pages/HomePage.tsx": "Home page introducing the site with navigation to learning content, quizzes, games, and progress tracking.",
  "frontend/src/pages/LearnIndexPage.tsx": "Displays a list of learning topics as cards linking to detailed topic pages, using static topic data.",
  "frontend/src/pages/LearnTopicPage.tsx": "Renders detailed content and key facts for a selected learning topic based on route params.",
  "frontend/src/pages/ProgressPage.tsx": "Shows user quiz progress, including total attempts, average score, and recent attempts using stored progress data.",
  "frontend/src/pages/QuizPlayPage.tsx": "Loads a quiz and handles question navigation, answer selection, scoring, and submitting quiz attempts.",
  "frontend/src/pages/QuizResultsPage.tsx": "Displays final quiz score, performance message, and answer review for the completed quiz.",
  "frontend/src/pages/QuizzesPage.tsx": "Lists all available quizzes with loading and error states, providing links to start each quiz.",
  "frontend/src/pages/SubscribePage.tsx": "React page showing free and premium subscription options with feature lists and navigation buttons.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session-based parameters, including hash-routing support.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, colors, fonts, animations, and included plugins.",
  "project_state.json": "Stores project metadata, existing features, pending feature requests, and project configuration state."
}